<center>
    <img src="https://gitlab.com/ibm/skills-network/courses/placeholder101/-/raw/master/labs/module%201/images/IDSNlogo.png"  width="300" alt="cognitiveclass.ai logo"  />
</center>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction

Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones.

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage.

Therefore if we can determine if the first stage will land, we can determine the cost of a launch.

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

<a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01" target="_blank">Spacex DataSet</a>

### Store the dataset in database table

**it is highly recommended to manually load the table using the database console LOAD tool in DB2**.

<img src = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload.png">

Now open the Db2 console, open the LOAD tool, Select / Drag the .CSV file for the  dataset, Next create a New Table, and then follow the steps on-screen instructions to load the data. Name the new table as follows:

**SPACEXDATASET**

**Follow these steps while using old DB2 UI which is having Open Console Screen**

**Note:While loading Spacex dataset, ensure that detect datatypes is disabled. Later click on the pencil icon(edit option).**

1.  Change the Date Format by manually typing DD-MM-YYYY and timestamp format as DD-MM-YYYY HH\:MM:SS.

    Here you should place the cursor at Date field and manually type as DD-MM-YYYY.

2.  Change the PAYLOAD_MASS\_\_KG\_  datatype  to INTEGER.

<img src = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload2.png">

**Changes to be considered when having DB2 instance with the new UI having Go to UI screen**

*   Refer to this insruction in this <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01">link</a> for viewing  the new  Go to UI screen.

*   Later click on **Data link(below SQL)**  in the Go to UI screen  and click on **Load Data** tab.

*   Later browse for the downloaded spacex file.

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/browsefile.png" width="800"/>

*   Once done select the schema andload the file.

 <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/spacexload3.png" width="800"/>

In [ ]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
!pip install ipython-sql

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

**DB2 magic in case of old UI service credentials.**

In the next cell enter your db2 connection string. Recall you created Service Credentials for your Db2 instance before. From the **uri** field of your Db2 service credentials copy everything after db2:// (except the double quote at the end) and paste it in the cell below after ibm_db_sa://

<img src ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_edX/images/URI.jpg">

in the following format

**%sql ibm_db_sa://my-username:my-password\@my-hostname:my-port/my-db-name**

**DB2 magic in case of new UI service credentials.**

<img src ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/images/servicecredentials.png" width=600>  

*   Use the following format.

*   Add security=SSL at the end

**%sql ibm_db_sa://my-username:my-password\@my-hostname:my-port/my-db-name?security=SSL**

In [2]:
#Replace the placeholder values with the actuals for your Db2 Service Credentials
dsn_driver = "{IBM DB2 ODBC DRIVER}"
dsn_database = "bludb"            # e.g. "BLUDB"
dsn_hostname = "b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud"            # e.g.: "dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net"
dsn_port = "32716"                    # e.g. "50000" 
dsn_protocol = "TCPIP"            # i.e. "TCPIP"
dsn_uid = "fsz66942"                 # e.g. "abc12345"
dsn_pwd = "orW2Glajusshdtft"                 # e.g. "7dBZ3wWt9XN6$o0J"
dsn_security = "SSL"              #i.e. "SSL"

In [4]:
import ibm_db

#Create database connection
#DO NOT MODIFY THIS CELL. Just RUN it with Shift + Enter
dsn = (
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};"
    "SECURITY={7};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd,dsn_security)

try:
    conn = ibm_db.connect(dsn, "", "")
    print ("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)

except:
    print ("Unable to connect: ", ibm_db.conn_errormsg() )

Connected to database:  bludb as user:  fsz66942 on host:  b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud

In [8]:
#%sql ibm_db_sa://

#Construct the query that retrieves all rows from the INSTRUCTOR table
selectQuery = "select * from SPACEXTBL LIMIT 10"

#Execute the statement
selectStmt = ibm_db.exec_immediate(conn, selectQuery)

#Fetch the rest of the rows and print the ID and FNAME for those rows
while ibm_db.fetch_row(selectStmt) != False:
   print (" ID:",  ibm_db.result(selectStmt, 0), " FNAME:",  ibm_db.result(selectStmt, "DATE"))

 ID: 1  FNAME: 2010-06-04
 ID: 2  FNAME: 2012-05-22
 ID: 3  FNAME: 2013-03-01
 ID: 4  FNAME: 2013-09-29
 ID: 5  FNAME: 2013-12-03
 ID: 6  FNAME: 2014-01-06
 ID: 7  FNAME: 2014-04-18
 ID: 8  FNAME: 2014-07-14
 ID: 9  FNAME: 2014-08-05
 ID: 10  FNAME: 2014-09-07

In [11]:
%sql ibm_db_sa://fsz66942:orW2Glajusshdtft@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb?security=SSL

In [13]:
%sql SELECT * FROM SPACEXTBL LIMIT 5;

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[(1, datetime.date(2010, 6, 4), 'Falcon 9', 6104, 'LEO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B0003', Decimal('-80.5773660'), Decimal('28.5618571')),
 (2, datetime.date(2012, 5, 22), 'Falcon 9', 525, 'LEO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B0005', Decimal('-80.5773660'), Decimal('28.5618571')),
 (3, datetime.date(2013, 3, 1), 'Falcon 9', 677, 'ISS', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B0007', Decimal('-80.5773660'), Decimal('28.5618571')),
 (4, datetime.date(2013, 9, 29), 'Falcon 9', 500, 'PO', 'VAFB SLC 4E', 'False Ocean', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B1003', Decimal('-120.6108290'), Decimal('34.6320930')),
 (5, datetime.date(2013, 12, 3), 'Falcon 9', 3170, 'GTO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B1004', Decimal('-80.5773660'), Decimal('28.5618571'))]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [14]:
%sql  SELECT UNIQUE launchsite FROM SPACEXTBL

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[('CCAFS SLC 40',), ('KSC LC 39A',), ('VAFB SLC 4E',)]

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [16]:
%sql SELECT * FROM SPACEXTBL WHERE launchsite LIKE 'CCA%' LIMIT 5;

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[(1, datetime.date(2010, 6, 4), 'Falcon 9', 6104, 'LEO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B0003', Decimal('-80.5773660'), Decimal('28.5618571')),
 (2, datetime.date(2012, 5, 22), 'Falcon 9', 525, 'LEO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B0005', Decimal('-80.5773660'), Decimal('28.5618571')),
 (3, datetime.date(2013, 3, 1), 'Falcon 9', 677, 'ISS', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B0007', Decimal('-80.5773660'), Decimal('28.5618571')),
 (5, datetime.date(2013, 12, 3), 'Falcon 9', 3170, 'GTO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B1004', Decimal('-80.5773660'), Decimal('28.5618571')),
 (6, datetime.date(2014, 1, 6), 'Falcon 9', 3325, 'GTO', 'CCAFS SLC 40', 'None None', 1, 'False', 'False', 'False', None, Decimal('1.0'), 0, 'B1005', Decimal('-80.5773660'), Decimal('28.5618571'))]

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [18]:
%sql SELECT SUM(PAYLOADMASS) FROM SPACEXTBL ;

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[(549440,)]

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [19]:
%sql SELECT AVG(PAYLOADMASS) FROM SPACEXTBL ;

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[(6104,)]

### Task 5

##### List the date when the first successful landing outcome in ground pad was acheived.

*Hint:Use min function*

In [20]:
%sql SELECT MIN(DATE) FROM SPACEXTBL WHERE OUTCOME = 'True RTLS';

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[(datetime.date(2015, 12, 22),)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [24]:
%sql SELECT UNIQUE SERIAL FROM SPACEXTBL WHERE OUTCOME = 'True ASDS' AND PAYLOADMASS > 4000 AND PAYLOADMASS < 6000;

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[('B1021',), ('B1022',), ('B1026',), ('B1031',), ('B1046',), ('B1059',)]

### Task 7

##### List the total number of successful and failure mission outcomes

In [26]:
%sql SELECT COUNT(*) FROM SPACEXTBL WHERE OUTCOME LIKE 'True%';

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[(60,)]

In [27]:
%sql SELECT COUNT(*) FROM SPACEXTBL WHERE OUTCOME LIKE 'False%';

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[(9,)]

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [28]:
%sql SELECT UNIQUE SERIAL FROM SPACEXTBL WHERE payloadmass in (SELECT max(payloadmass)FROM SPACEXTBL);

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[('B1048',), ('B1051',)]

### Task 9

##### List the failed landing_outcomes in drone ship, their booster versions, and launch site names for in year 2015

In [33]:
%sql SELECT * FROM SPACEXTBL WHERE OUTCOME LIKE 'False ASDS%' and year(date)=2015;

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[(12, datetime.date(2015, 1, 10), 'Falcon 9', 2395, 'ISS', 'CCAFS SLC 40', 'False ASDS', 1, 'True', 'False', 'True', '5e9e3032383ecb761634e7cb', Decimal('1.0'), 0, 'B1012', Decimal('-80.5773660'), Decimal('28.5618571')),
 (14, datetime.date(2015, 4, 14), 'Falcon 9', 1898, 'ISS', 'CCAFS SLC 40', 'False ASDS', 1, 'True', 'False', 'True', '5e9e3032383ecb761634e7cb', Decimal('1.0'), 0, 'B1015', Decimal('-80.5773660'), Decimal('28.5618571'))]

### Task 10

##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

In [37]:
%sql SELECT outcome, count(*) FROM SPACEXTBL WHERE date between '2010-06-04 ' and '2017-03-20' group by outcome order by count(*) desc;

 * ibm_db_sa://fsz66942:***@b70af05b-76e4-4bca-a1f5-23dbb4c6a74e.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32716/bludb
Done.

[('None None', 9),
 ('True ASDS', 5),
 ('False ASDS', 4),
 ('True Ocean', 3),
 ('True RTLS', 3),
 ('False Ocean', 2),
 ('None ASDS', 2)]

### Reference Links

*   <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01&origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01&origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01&origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*   <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log

| Date       | Version | Changed by    | Change Description        |
| ---------- | ------- | ------------- | ------------------------- |
| 2021-10-12 | 0.4     | Lakshmi Holla | Changed markdown          |
| 2021-08-24 | 0.3     | Lakshmi Holla | Added library update      |
| 2021-07-09 | 0.2     | Lakshmi Holla | Changes made in magic sql |
| 2021-05-20 | 0.1     | Lakshmi Holla | Created Initial Version   |

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>